{
  "project": "Mjolnir",
  "branchName": "ralph/bi-c-dashboard-ui",
  "description": "Budget Intelligence Phase C — Complete dashboard UI rebuild. Replaces the flat category budget page with a saver-based overview, goal tracker, drill-down views, charts, AI check-in card, tag explorer, and transaction list with three-tier classification.",
  "userStories": [
    {
      "id": "BI-C-001",
      "title": "Build budget overview page with saver progress bars",
      "description": "Replace the current budget page with a saver-based overview showing spending savers with budget vs actual progress bars and traffic light status indicators.",
      "acceptanceCriteria": [
        "Replace the content of app/(dashboard)/budget/page.tsx with the new saver-based layout",
        "Page header shows current period dates (e.g. '14 Feb – 13 Mar 2026') with left/right arrows to navigate periods",
        "Summary stats row: Income, Total Spent, Total Saved, with an overall progress bar showing % spent",
        "Show 'Day X of Y (Z% through period)' text below the summary",
        "Spending Savers section: render each spending saver (saverType='spending') as a card with emoji + name, budget amount, actual amount, percentage progress bar, and traffic light indicator",
        "Traffic light: green dot if under 85% pace, amber/yellow if 85-100% pace, red if over 100% pace; checkmark for fixed amounts already paid (e.g. rent at exactly 100%)",
        "Progress bar colour matches the saver's colour from the database",
        "Each saver card shows a collapsed preview of its top 3-4 categories with amounts",
        "Saver cards are clickable — navigate to saver detail view (BI-C-003)",
        "Use useBudgetSummary() hook for all data",
        "Loading skeleton state while data is fetching",
        "Dark mode styling consistent with existing Mjolnir design (Card components, existing colour tokens)",
        "npm run build && npm run lint passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Reference the wireframe in spec Section 7.1. The summary stats should use existing Stat Card patterns if available. Progress bars can use shadcn Progress component or custom."
    },
    {
      "id": "BI-C-002",
      "title": "Build goal tracker widget",
      "description": "Create a goal tracker section on the budget page that shows all active financial goals with progress bars, monthly contribution, and ETA.",
      "acceptanceCriteria": [
        "Create components/budget/goal-tracker.tsx component",
        "Section header: '🎯 GOALS' positioned below the spending savers section",
        "Render each active goal as a card: icon + name, current/target amount (e.g. '$4,500 / $15,000'), percentage, progress bar, monthly contribution, ETA date",
        "Progress bar colour matches the goal's colour field",
        "For debt payoff goals, show 'Clears [month year]' instead of 'ETA [date]'",
        "Completed goals show a checkmark and completion date instead of progress bar",
        "Use useBudgetGoals() hook for data",
        "Goal cards support click to expand (inline) showing notes and edit button for currentAmountCents",
        "Edit button opens a simple inline form to update current balance (calls useUpdateGoal mutation)",
        "Loading skeleton state",
        "npm run build && npm run lint passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Reference spec Section 7.1 goals wireframe. Keep it simple — no progress rings yet (that's BI-C-009 area). Linear progress bars are clearer for the overview."
    },
    {
      "id": "BI-C-003",
      "title": "Build saver detail view with category drilldown",
      "description": "Create a detail view that shows when a user clicks a saver on the budget overview. Shows category breakdown, pace comparison, and recent transactions for that saver.",
      "acceptanceCriteria": [
        "Create app/(dashboard)/budget/saver/[saverKey]/page.tsx as a dynamic route",
        "Back button/link at top: '← Back to Budget'",
        "Saver header: emoji + name, budget vs actual, percentage progress bar, traffic light status",
        "Show pace comparison: 'Pace: X% vs expected Y%' based on days elapsed",
        "Categories section: list all categories under this saver with individual progress bars",
        "Each category shows: name, budget amount (if set), actual amount, percentage bar, status indicator",
        "Categories without sub-budgets show only the actual amount (no percentage)",
        "Recent Transactions section at bottom: last 20 transactions for this saver, showing date, description, amount, category, and tags as pills/badges",
        "Fetch saver details from the budget summary API (filtered to specific saver) or create a dedicated endpoint",
        "Fetch transactions via existing /api/budget/transactions with saver filter",
        "Loading skeleton state",
        "npm run build && npm run lint passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Reference spec Section 7.2 wireframe. Add saverKey as a query param filter to the existing transactions API (GET /api/budget/transactions?saver=food)."
    },
    {
      "id": "BI-C-004",
      "title": "Build budget vs actual bar chart",
      "description": "Create a horizontal bar chart showing budget vs actual for each spending saver, with a pace indicator line. This is the primary 'am I on track' visualisation.",
      "acceptanceCriteria": [
        "Create components/budget/charts/budget-vs-actual-chart.tsx",
        "Horizontal bar chart with one row per spending saver",
        "Each row shows: saver emoji + name on left, budget bar (outlined/semi-transparent) and actual bar (solid fill) overlaid, dollar amounts on right",
        "Bar colour matches the saver's colour from the database",
        "If actual exceeds budget, the overflow portion renders in red/destructive colour",
        "Vertical dashed reference line at the 'expected pace' position (progressPercent% of budget)",
        "Chart uses Recharts BarChart or custom SVG — whichever produces a cleaner result",
        "Place on the budget overview page between the summary stats and the saver cards",
        "Responsive: works on mobile (393pt width) — may stack labels above bars on small screens",
        "Data comes from useBudgetSummary() hook",
        "npm run build && npm run lint passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Reference spec Section 7.3.1. Use hex colours from the savers table for bars. The pace line helps answer 'should I be worried?' at a glance."
    },
    {
      "id": "BI-C-005",
      "title": "Build spending pace line chart",
      "description": "Create a cumulative spending line chart that shows actual spending over time vs the budget pace line (straight diagonal). Highlights whether spending is ahead or behind pace.",
      "acceptanceCriteria": [
        "Create components/budget/charts/spending-pace-chart.tsx",
        "X-axis: days of the current period (1 through totalDays)",
        "Y-axis: cumulative spend in dollars",
        "Grey dashed diagonal line from $0 to total budget = the 'pace line'",
        "Coloured solid line plotting cumulative actual spending day by day",
        "Area between the lines: green fill if actual is below pace, red fill if above",
        "Vertical dotted line marking 'today'",
        "Use Recharts AreaChart with a ReferenceLine",
        "Data: fetch transactions for the current period, sort by date, compute running total per day",
        "Place on the budget overview page (collapsible section or tab alongside the bar chart)",
        "Tooltip on hover showing the date, cumulative spend, and pace amount",
        "npm run build && npm run lint passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Reference spec Section 7.3.2. This requires per-day transaction data — may need a new API endpoint or client-side grouping from the transaction list."
    },
    {
      "id": "BI-C-006",
      "title": "Build AI check-in card",
      "description": "Create the AI check-in card that displays the latest Claude recommendation with traffic light health checks, insights, and actionable tip. Includes a 'Run Check-in' button to trigger a new recommendation.",
      "acceptanceCriteria": [
        "Create components/budget/ai-checkin-card.tsx",
        "Card header: '🤖 AI Check-in' with 'Last run: X ago' timestamp",
        "Overall status indicator: large coloured dot (green/amber/red) with status text and summary sentence",
        "Saver Health grid: 2-column grid showing each spending saver with its emoji, name, and status dot",
        "Insights section: bulleted list of 3-5 insight strings from the recommendation",
        "Actionable Tip section: highlighted box with the specific tip text",
        "'Run Check-in' button that calls useRequestRecommendation() mutation",
        "Loading state while recommendation is being generated (show spinner, 'Analysing your budget...' text)",
        "Poll for result: after triggering, poll the recommendations endpoint every 5 seconds until a new recommendation appears (or timeout after 60 seconds)",
        "Empty state when no recommendation exists yet: 'No check-in yet. Run your first AI check-in to get personalised insights.'",
        "Use useLatestRecommendation() hook for display data",
        "Place at the bottom of the budget overview page",
        "npm run build && npm run lint passes"
      ],
      "priority": 6,
      "passes": false,
      "notes": "Reference spec Section 7.4 wireframe. The n8n flow processes asynchronously — Mjolnir sends the request and then polls the callback result. Use queryClient.invalidateQueries on a timer to poll."
    },
    {
      "id": "BI-C-007",
      "title": "Update transaction list with saver/category/tags display",
      "description": "Update the existing transaction list to show the three-tier classification (saver → category → tags) on each transaction, with an edit button for manual corrections.",
      "acceptanceCriteria": [
        "Update the transaction list component (likely in budget page or a shared component) to show: saver emoji + name, category name, formatted as 'emoji Saver → Category'",
        "Show tags as small pill/badge elements below the transaction description (e.g. 'bft · weekly · fixed-cost')",
        "Tags use a muted/secondary colour style to avoid visual noise",
        "Update the GET /api/budget/transactions endpoint to include saverKey, categoryKey, and tags in the response if not already",
        "Add filter capabilities: filter by saverKey, filter by categoryKey, filter by tag (via query params)",
        "Add an 'Edit' button on each transaction row that opens an inline or modal editor",
        "Edit form allows changing: saverKey (dropdown of active savers), categoryKey (dropdown filtered by selected saver), tags (comma-separated text input or tag chips)",
        "Save edit calls PUT /api/budget/transactions/[id]/category (update this endpoint to also accept saverKey, categoryKey, and tags)",
        "npm run build && npm run lint passes"
      ],
      "priority": 7,
      "passes": false,
      "notes": "Reference spec Section 7.6 wireframe. The edit capability is important for correcting mis-classifications. When saver changes in the dropdown, the category dropdown should filter to show only that saver's categories."
    },
    {
      "id": "BI-C-008",
      "title": "Build tag explorer page",
      "description": "Create a dedicated /budget/tags page for cross-cutting tag analysis — showing tags ranked by spend with count, total, and average per transaction.",
      "acceptanceCriteria": [
        "Create app/(dashboard)/budget/tags/page.tsx",
        "Page header: '🏷️ Tag Explorer'",
        "Period selector: dropdown to choose which budget period to analyse (default: current)",
        "Search input to filter tags by name",
        "Table view: columns for Tag, Count (number of transactions), Total Spend, Average per Transaction",
        "Table sorted by Total Spend descending by default, with clickable column headers to re-sort",
        "Clicking a tag row navigates to a filtered transaction list showing only transactions with that tag",
        "Create API endpoint: GET /api/budget/tags?period_id=X — aggregates tags from upTransactions, returns array of { tag, count, totalCents, avgCents }",
        "The API endpoint unnests the JSONB tags array and groups by tag value",
        "Handle empty state: 'No tagged transactions in this period'",
        "Add 'Tags' link to the budget page (or as a sub-nav item)",
        "npm run build && npm run lint passes"
      ],
      "priority": 8,
      "passes": false,
      "notes": "Reference spec Section 7.5 wireframe. The JSONB unnest query: SELECT tag, COUNT(*), SUM(ABS(amount_cents)) FROM up_transactions, jsonb_array_elements_text(tags) AS tag WHERE ... GROUP BY tag ORDER BY SUM DESC. May need a raw SQL query via Drizzle's sql template."
    },
    {
      "id": "BI-C-009",
      "title": "Build category treemap chart",
      "description": "Create a treemap visualisation for the saver detail view showing proportional spend by category within a saver.",
      "acceptanceCriteria": [
        "Create components/budget/charts/category-treemap.tsx",
        "Treemap shows proportional rectangles for each category within a saver",
        "Rectangle size = category spend amount relative to total saver spend",
        "Each rectangle shows: category name, dollar amount, percentage of saver total",
        "Rectangle colour: green if under pace, amber if near budget, red if over budget",
        "Use Recharts Treemap component",
        "Place on the saver detail view (BI-C-003) above or alongside the category list",
        "Clickable rectangles: clicking filters the transaction list to that category",
        "Graceful handling when a saver has only 1-2 categories (treemap still renders sensibly)",
        "npm run build && npm run lint passes"
      ],
      "priority": 9,
      "passes": false,
      "notes": "Reference spec Section 7.3.3. This is a nice visual complement to the category list — shows at a glance where the money went within a saver."
    },
    {
      "id": "BI-C-010",
      "title": "Build savings waterfall chart",
      "description": "Create a waterfall chart showing how income flows into spending savers, savings goals, and investments — replacing the Sankey chart.",
      "acceptanceCriteria": [
        "Create components/budget/charts/savings-waterfall.tsx",
        "Waterfall starts with income bar ($9,168) at the top/left",
        "Each saver allocation shown as a descending block, ordered by sort_order",
        "Spending savers in warm colours, savings goals in cool colours, investments in a distinct colour",
        "Each bar labelled with saver emoji + name and dollar amount",
        "Final bar: 'Remaining' (income minus all allocations) — this is the spending float",
        "Use Recharts BarChart with waterfall positioning (each bar starts where the previous ended) or a custom SVG",
        "Place on the budget overview page as a toggle/tab alternative to the budget vs actual chart",
        "Responsive on mobile — may render vertically on small screens",
        "npm run build && npm run lint passes"
      ],
      "priority": 10,
      "passes": false,
      "notes": "Reference spec Section 7.3.7. This replaces the Sankey chart. Waterfall charts are more readable for showing 'where does the money go'. Remove or hide the old SankeyChartContainer component."
    },
    {
      "id": "BI-C-011",
      "title": "Build month-over-month trend chart",
      "description": "Create a multi-period comparison chart showing how each saver's spending compares across budget periods.",
      "acceptanceCriteria": [
        "Create components/budget/charts/spending-trends.tsx (or update existing SpendingTrends component)",
        "Line chart or grouped bar chart with X-axis as budget periods (last 6 periods) and Y-axis as spend in dollars",
        "One line/bar group per spending saver, coloured by saver colour",
        "Budget reference line overlaid per saver (horizontal line at budget amount)",
        "Legend showing saver names with colour indicators",
        "Toggle to view all savers or select specific ones (checkbox filter)",
        "Create API endpoint: GET /api/budget/trends?periods=6 — returns per-saver spend for the last N completed periods",
        "Use Recharts LineChart or BarChart",
        "Place on the budget overview page in a collapsible 'Trends' section or as a separate tab",
        "npm run build && npm run lint passes"
      ],
      "priority": 11,
      "passes": false,
      "notes": "Reference spec Section 7.3.6. Key use case: see if supplement spend actually drops after April 2026. Existing SpendingTrends component may have useful logic to build on."
    },
    {
      "id": "BI-C-012",
      "title": "Mobile responsive pass for all budget views",
      "description": "Review and fix all new budget components for mobile responsiveness on iPhone 16 Pro (393pt wide). Roland checks his budget on his phone.",
      "acceptanceCriteria": [
        "Budget overview page: cards stack single-column on mobile, progress bars fill width, text doesn't truncate awkwardly",
        "Goal tracker: cards stack single-column, progress bars readable",
        "Saver detail view: category list full-width, transaction list readable with saver/category/tags not overflowing",
        "Charts: budget vs actual chart readable at 393pt (labels may abbreviate), pace chart scales down, waterfall stacks vertically if needed",
        "AI check-in card: saver health grid goes to 1 column on mobile, insights text wraps properly",
        "Tag explorer: table scrolls horizontally if needed, or switches to a card layout on mobile",
        "Transaction edit form: dropdowns and tag input usable on mobile keyboard",
        "Period navigation arrows have sufficient tap targets (min 44pt)",
        "Test with browser dev tools at 393px width (iPhone 16 Pro viewport)",
        "No horizontal scroll on any budget page at 393px",
        "npm run build && npm run lint passes"
      ],
      "priority": 12,
      "passes": false,
      "notes": "Mobile-first is a design principle for Mjolnir. Roland checks balances on his phone. Use Tailwind responsive classes (sm:, md:, lg:) for breakpoints."
    }
  ]
}
