{
  "project": "Mjolnir",
  "branchName": "ralph/bi-a-database-schema",
  "description": "Budget Intelligence Phase A — Database schema changes for the three-tier budget system (savers, categories, goals). Creates new tables, modifies upTransactions, seeds data, refactors period auto-generation, and removes manual period configuration.",
  "userStories": [
    {
      "id": "BI-A-001",
      "title": "Create budget_savers table and Drizzle schema",
      "description": "Create the budget_savers table that represents UP Bank savers — the top-level budget tier. Each saver has a monthly budget amount and a type (spending, savings_goal, or investment).",
      "acceptanceCriteria": [
        "Add budgetSavers table to lib/db/schema.ts with columns: id (uuid PK), saverKey (varchar 50, unique), displayName (varchar 100), emoji (varchar 10), monthlyBudgetCents (bigint), saverType (enum: 'spending' | 'savings_goal' | 'investment'), sortOrder (integer), isActive (boolean default true), colour (varchar 7 for hex), notes (text nullable), createdAt, updatedAt",
        "Create Drizzle enum for saverType if not using check constraint",
        "Add unique index on saverKey",
        "Export the table, relations, and inferred types (BudgetSaver, NewBudgetSaver)",
        "Run npm run db:generate to create migration",
        "Run npm run db:migrate to apply",
        "npm run build && npm run lint passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": "Single-user app — no user_id column needed (matches existing pattern). Use bigint for cents to match budgetAllocations convention."
    },
    {
      "id": "BI-A-002",
      "title": "Refactor budget_categories to link to savers",
      "description": "The existing budgetCategories table is a flat list. Restructure it so each category belongs to a saver via a saverId FK. Add categoryKey for machine-readable identifier. Keep the existing id column but add the new fields.",
      "acceptanceCriteria": [
        "Add saverId column (uuid, FK to budgetSavers.id, ON DELETE CASCADE) to budgetCategories table in schema.ts",
        "Add categoryKey column (varchar 50) to budgetCategories table",
        "Add monthlyBudgetCents column (bigint, nullable) for optional per-category sub-budgets",
        "Add isActive column (boolean, default true)",
        "Add unique constraint on (saverId, categoryKey)",
        "Update budgetCategories relations to include the belongsTo budgetSavers relation",
        "Add budgetSavers relations to include hasMany budgetCategories",
        "Run npm run db:generate to create migration",
        "Run npm run db:migrate to apply",
        "Existing API routes that read budgetCategories still work (columns are additive)",
        "npm run build && npm run lint passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": "New columns should be nullable initially so existing data doesn't break. Seed story will populate them. The old columns (icon, colour, isIncome, isSystem) can remain for now — removal is a separate cleanup."
    },
    {
      "id": "BI-A-003",
      "title": "Create goals table",
      "description": "Create the goals table that tracks savings goals with progress, ETAs, and monthly contribution amounts. Goals link to the saver that funds them.",
      "acceptanceCriteria": [
        "Add goals table to lib/db/schema.ts with columns: id (uuid PK), saverId (uuid, FK to budgetSavers.id, nullable), name (varchar 100), targetAmountCents (bigint), currentAmountCents (bigint, default 0), monthlyContributionCents (bigint), targetDate (date, nullable), status (enum: 'active' | 'completed' | 'paused', default 'active'), priority (integer, default 0), colour (varchar 7, nullable), icon (varchar 10, nullable), notes (text, nullable), completedAt (timestamp, nullable), createdAt, updatedAt",
        "Export table, relations, and inferred types (Goal, NewGoal)",
        "Add relation from goals to budgetSavers (belongsTo)",
        "Add relation from budgetSavers to goals (hasMany)",
        "Run npm run db:generate and npm run db:migrate",
        "npm run build && npm run lint passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": "saverId is nullable because some goals (like debt payoff) may not have a direct saver link, or the saver IS the goal. Priority field controls display order."
    },
    {
      "id": "BI-A-004",
      "title": "Add three-tier classification fields to upTransactions",
      "description": "Add saverKey, categoryKey, and tags columns to the upTransactions table so transactions carry the full three-tier classification from n8n.",
      "acceptanceCriteria": [
        "Add saverKey column (varchar 50, nullable) to upTransactions in schema.ts",
        "Add categoryKey column (varchar 50, nullable) to upTransactions in schema.ts",
        "Add tags column (jsonb, default '[]') to upTransactions in schema.ts",
        "Add database index on saverKey",
        "Add database index on categoryKey",
        "Add composite index on (saverKey, categoryKey)",
        "Add GIN index on tags for efficient JSONB queries",
        "Run npm run db:generate and npm run db:migrate",
        "Existing transaction queries and API routes still work (columns are nullable/additive)",
        "npm run build && npm run lint passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": "Drizzle may not support GIN indexes natively — if not, add a raw SQL migration for the GIN index. The saverKey/categoryKey columns are intentionally NOT FKs to keep the system flexible (classification comes from n8n rules, not DB constraints)."
    },
    {
      "id": "BI-A-005",
      "title": "Update ai_recommendations schema for structured responses",
      "description": "The existing aiRecommendations table stores a generic JSONB blob. Update it to store the new structured recommendation format with overall_status, saver_statuses, goal_progress, insights, and actionable_tip.",
      "acceptanceCriteria": [
        "Add overallStatus column (varchar 10, nullable) to aiRecommendations — values: 'green', 'amber', 'red'",
        "Add saverStatuses column (jsonb, nullable) — array of per-saver health checks",
        "Add goalProgress column (jsonb, nullable) — array of goal updates",
        "Add budgetAdjustments column (jsonb, nullable) — suggested budget changes",
        "Add insights column (jsonb, nullable) — array of insight strings",
        "Add actionableTip column (text, nullable) — specific time-bound action",
        "Add savingsProjection column (jsonb, nullable) — savings rate and projections",
        "Add rawResponse column (jsonb, nullable) — full Claude response for debugging",
        "Add generatedAt column (timestamp, nullable) — when the recommendation was generated",
        "Keep existing recommendationData column for backwards compatibility",
        "Run npm run db:generate and npm run db:migrate",
        "npm run build && npm run lint passes"
      ],
      "priority": 5,
      "passes": false,
      "notes": "All new columns nullable so existing recommendations don't break. New recommendations will populate the structured columns; old ones still have recommendationData."
    },
    {
      "id": "BI-A-006",
      "title": "Seed savers and categories data",
      "description": "Create a seed script that populates budget_savers and updates budget_categories with the full taxonomy from the spec. This covers all 10 savers and their nested categories.",
      "acceptanceCriteria": [
        "Create lib/db/seeds/budget-savers.ts (or similar) with a seedBudgetSavers() function",
        "Seed all 10 savers: rent ($2,129), essentials ($1,157), food ($904), supplements ($476), debt ($351.91), vitamins ($100), emergency ($1,500), homelab ($500), pearler ($600), spending ($1,451)",
        "Set correct saverType: rent/essentials/food/supplements/debt/spending = 'spending', vitamins/emergency/homelab = 'savings_goal', pearler = 'investment'",
        "Set emoji, colour (unique hex per saver), sortOrder, and notes (e.g. 'TEMPORARY — drops post-April 2026' for supplements)",
        "Seed all categories under each saver: rent(1), essentials(10), food(5), supplements(5), debt(2), spending(10) = 33 categories total",
        "Each category has categoryKey, displayName, saverId (looked up by saverKey), sortOrder",
        "Use upsert pattern (INSERT ON CONFLICT DO UPDATE) so re-running is idempotent",
        "Create an API route or script entry point to trigger seeding: npm run db:seed or app/api/admin/seed/route.ts",
        "npm run build && npm run lint passes"
      ],
      "priority": 6,
      "passes": false,
      "notes": "Reference the full taxonomy from the spec (Section 2 and Appendix 9). Cents values: $2,129 = 212900, $351.91 = 35191, etc."
    },
    {
      "id": "BI-A-007",
      "title": "Seed goals data",
      "description": "Seed the goals table with Roland's active financial goals: Emergency Fund, Homelab Build, Vitamin Reserve, ZIP Payoff, and ANZ Payoff.",
      "acceptanceCriteria": [
        "Add goal seeding to the seed script from BI-A-006 (or create lib/db/seeds/goals.ts)",
        "Seed Emergency Fund: target $15,000, monthly $1,500, ETA Jan 2027, linked to emergency saver, icon '🚨', status 'active', priority 1",
        "Seed Homelab Build: target $5,000, monthly $500, ETA Jan 2027, linked to homelab saver, icon '🖥️', status 'active', priority 2",
        "Seed Vitamin Reserve: target $500, monthly $100, ETA Aug 2026, linked to vitamins saver, icon '💊', status 'active', priority 3",
        "Seed ZIP Payoff: target $269, monthly $51.91, clears Jul 2026, linked to debt saver, icon '💳', status 'active', priority 4",
        "Seed ANZ Payoff: target $2,300, monthly $300, clears Oct 2026, linked to debt saver, icon '💳', status 'active', priority 5",
        "All cent values are integers: $15,000 = 1500000, $51.91 = 5191, etc.",
        "Use upsert pattern so re-running is idempotent (match on name or a goal_key)",
        "npm run build && npm run lint passes"
      ],
      "priority": 7,
      "passes": false,
      "notes": "currentAmountCents starts at 0 — will be updated manually or via future automation. targetDate should be calculated from the monthly contribution rate."
    },
    {
      "id": "BI-A-008",
      "title": "Refactor budget period auto-generation",
      "description": "Update the existing payday.ts utility to implement the spec's auto-generation rules: payday is always the 14th (adjusted for weekends), periods auto-generate on dashboard load.",
      "acceptanceCriteria": [
        "Update lib/budget/payday.ts with getPayday(year, month) function: returns the 14th, or Friday 13th if Saturday, or Friday 12th if Sunday",
        "Add generatePeriod(year, month) function that returns { start: payday, end: dayBeforeNextPayday }",
        "Add ensureCurrentPeriodExists() function that checks if a budget_period contains today's date, and creates one if not",
        "ensureCurrentPeriodExists() uses the fixed expectedIncomeCents of 916853 ($9,168.53) when auto-generating",
        "Remove dependency on paydayConfig table — payday is hardcoded to 14th with weekend adjustment",
        "Add unit tests or at least inline test cases in comments verifying: Feb 2026 (14th is Saturday → 13th), Mar 2026 (14th is Saturday → 13th), Apr 2026 (14th is Tuesday → 14th)",
        "Export the utility functions for use in API routes and dashboard loader",
        "npm run build && npm run lint passes"
      ],
      "priority": 8,
      "passes": false,
      "notes": "The existing paydayConfig table and its API routes can remain for now but won't be used. The period header should display as '14 Feb – 13 Mar 2026' format."
    },
    {
      "id": "BI-A-009",
      "title": "Remove manual period configuration and setup wizard",
      "description": "Remove the budget setup wizard (3-step flow: payday config, income, template/allocations) and the manual period creation UI. Periods are now auto-generated.",
      "acceptanceCriteria": [
        "Remove or redirect app/(dashboard)/budget/setup/page.tsx — redirect /budget/setup to /budget",
        "Remove the PeriodSelector dropdown that allows manual period selection (keep a read-only period date display in the budget header)",
        "Remove the 'New Period' or 'Configure Period' buttons from the budget page",
        "Remove PaySplitConfig component usage if it's for manual allocation setup",
        "Remove CategoryManager component usage if it's for managing the flat category list",
        "The budget page header should display the current period dates (e.g. '14 Feb – 13 Mar 2026') as static text, not editable",
        "Add left/right arrows to navigate between periods (view historical data) but not create/edit them",
        "Call ensureCurrentPeriodExists() on budget page load (server component or API call)",
        "Remove or deprecate API routes: DELETE /api/budget/periods/[id], POST /api/budget/periods (keep GET for reading)",
        "npm run build && npm run lint passes"
      ],
      "priority": 9,
      "passes": false,
      "notes": "Be conservative — don't delete files that might have useful logic. Comment out or disable rather than delete if unsure. The period navigation (viewing old periods) should still work."
    }
  ]
}
